
. 
.   reg slpnap d81 totwrk educ gdhlth marr yngkid

      Source |       SS           df       MS      Number of obs   =       478
-------------+----------------------------------   F(6, 471)       =      8.50
       Model |  12812772.5         6  2135462.09   Prob > F        =    0.0000
    Residual |   118370944       471  251318.353   R-squared       =    0.0977
-------------+----------------------------------   Adj R-squared   =    0.0862
       Total |   131183717       477  275018.274   Root MSE        =    501.32

------------------------------------------------------------------------------
      slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -77.02965   47.96519    -1.61   0.109    -171.2819    17.22259
      totwrk |  -.1500954   .0244002    -6.15   0.000    -.1980421   -.1021487
        educ |  -20.25655   8.000179    -2.53   0.012    -35.97701   -4.536091
      gdhlth |   29.03733   59.57889     0.49   0.626    -88.03599    146.1107
        marr |  -42.19389   53.07869    -0.79   0.427    -146.4942    62.10645
      yngkid |    74.2579   77.32582     0.96   0.337    -77.68838    226.2042
       _cons |   3958.756   121.7663    32.51   0.000     3719.483    4198.028
------------------------------------------------------------------------------

. 
.   reg slpnap d81 totwrk educ gdhlth marr yngkid, cluster(id)

Linear regression                               Number of obs     =        478
                                                F(6, 238)         =       6.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0977
                                                Root MSE          =     501.32

                                   (Std. err. adjusted for 239 clusters in id)
------------------------------------------------------------------------------
             |               Robust
      slpnap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -77.02965   40.19112    -1.92   0.056    -156.2054    2.146106
      totwrk |  -.1500954   .0263294    -5.70   0.000    -.2019639   -.0982269
        educ |  -20.25655   9.903514    -2.05   0.042    -39.76629   -.7468096
      gdhlth |   29.03733    67.1216     0.43   0.666     -103.191    161.2656
        marr |  -42.19389   59.75853    -0.71   0.481    -159.9171    75.52931
      yngkid |    74.2579   76.51451     0.97   0.333    -76.47427    224.9901
       _cons |   3958.756   169.6107    23.34   0.000     3624.626    4292.886
------------------------------------------------------------------------------

. * Q: What's the difference between above 2 regression tables and why?   
. 
.   xtset id year

Panel variable: id (strongly balanced)
 Time variable: year, 75 to 81, but with gaps
         Delta: 1 unit

.   *change re to fe below
.   xtreg slpnap d81 totwrk educ gdhlth marr yngkid, fe

Fixed-effects (within) regression               Number of obs     =        478
Group variable: id                              Number of groups  =        239

R-squared:                                      Obs per group:
     Within  = 0.1552                                         min =          2
     Between = 0.0416                                         avg =        2.0
     Overall = 0.0736                                         max =          2

                                                F(6,233)          =       7.13
corr(u_i, Xb) = -0.1843                         Prob > F          =     0.0000

------------------------------------------------------------------------------
      slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -92.63404    45.8659    -2.02   0.045    -182.9989   -2.269152
      totwrk |  -.2266694    .036054    -6.29   0.000    -.2977029   -.1556359
        educ |  -.0244717   48.75938    -0.00   1.000    -96.09008    96.04113
      gdhlth |   87.57785   76.59913     1.14   0.254    -63.33758    238.4933
        marr |   104.2139   92.85536     1.12   0.263    -78.72946    287.1574
      yngkid |    94.6654   87.65252     1.08   0.281    -78.02739    267.3582
       _cons |   3696.638   664.4898     5.56   0.000     2387.462    5005.815
-------------+----------------------------------------------------------------
     sigma_u |  416.55594
     sigma_e |  423.25788
         rho |  .49202023   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(238, 233) = 1.80                    Prob > F = 0.0000

. 
.   sort id year

.   by id: gen d_d81=d81[2]-d81[1] if _n==2
(239 missing values generated)

.   by id: gen d_slpnap=slpnap[2]-slpnap[1] if _n==2
(239 missing values generated)

.   by id: gen d_totwrk=totwrk[2]-totwrk[1] if _n==2
(239 missing values generated)

.   by id: gen d_educ=educ[2]-educ[1] if _n==2
(239 missing values generated)

.   by id: gen d_gdhlth=gdhlth[2]-gdhlth[1] if _n==2
(239 missing values generated)

.   by id: gen d_marr=marr[2]-marr[1] if _n==2
(239 missing values generated)

.   by id: gen d_yngkid=yngkid[2]-yngkid[1] if _n==2
(239 missing values generated)

. 
.   reg d_slpnap d_totwrk d_educ d_gdhlth d_marr d_yngkid

      Source |       SS           df       MS      Number of obs   =       239
-------------+----------------------------------   F(5, 233)       =      8.19
       Model |  14674698.2         5  2934939.64   Prob > F        =    0.0000
    Residual |  83482611.7       233  358294.471   R-squared       =    0.1495
-------------+----------------------------------   Adj R-squared   =    0.1313
       Total |  98157309.9       238  412425.672   Root MSE        =    598.58

------------------------------------------------------------------------------
    d_slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    d_totwrk |  -.2266694    .036054    -6.29   0.000    -.2977029   -.1556359
      d_educ |  -.0244717   48.75938    -0.00   1.000    -96.09008    96.04113
    d_gdhlth |   87.57785   76.59913     1.14   0.254    -63.33758    238.4933
      d_marr |   104.2139   92.85536     1.12   0.263    -78.72946    287.1574
    d_yngkid |    94.6654   87.65252     1.08   0.281    -78.02739    267.3582
       _cons |  -92.63404    45.8659    -2.02   0.045    -182.9989   -2.269152
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\u1972955\AppData\Local\Temp\STD4904_000000.tmp"

.   xtreg slpnap d81 totwrk educ gdhlth marr yngkid, fe

Fixed-effects (within) regression               Number of obs     =        478
Group variable: id                              Number of groups  =        239

R-squared:                                      Obs per group:
     Within  = 0.1552                                         min =          2
     Between = 0.0416                                         avg =        2.0
     Overall = 0.0736                                         max =          2

                                                F(6,233)          =       7.13
corr(u_i, Xb) = -0.1843                         Prob > F          =     0.0000

------------------------------------------------------------------------------
      slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -92.63404    45.8659    -2.02   0.045    -182.9989   -2.269152
      totwrk |  -.2266694    .036054    -6.29   0.000    -.2977029   -.1556359
        educ |  -.0244717   48.75938    -0.00   1.000    -96.09008    96.04113
      gdhlth |   87.57785   76.59913     1.14   0.254    -63.33758    238.4933
        marr |   104.2139   92.85536     1.12   0.263    -78.72946    287.1574
      yngkid |    94.6654   87.65252     1.08   0.281    -78.02739    267.3582
       _cons |   3696.638   664.4898     5.56   0.000     2387.462    5005.815
-------------+----------------------------------------------------------------
     sigma_u |  416.55594
     sigma_e |  423.25788
         rho |  .49202023   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(238, 233) = 1.80                    Prob > F = 0.0000

. 
end of do-file

. reg slpnap d81 totwrk educ gdhlth marr yngkid, a(id)

Linear regression, absorbing indicators         Number of obs     =        478
                                                F(6, 233)         =       7.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6818
                                                Adj R-squared     =     0.3486
                                                Root MSE          =     423.26

------------------------------------------------------------------------------
      slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -92.63404    45.8659    -2.02   0.045    -182.9989   -2.269152
      totwrk |  -.2266694    .036054    -6.29   0.000    -.2977029   -.1556359
        educ |  -.0244717   48.75938    -0.00   1.000    -96.09008    96.04113
      gdhlth |   87.57785   76.59913     1.14   0.254    -63.33758    238.4933
        marr |   104.2139   92.85536     1.12   0.263    -78.72946    287.1574
      yngkid |    94.6654   87.65252     1.08   0.281    -78.02739    267.3582
       _cons |   3696.638   664.4898     5.56   0.000     2387.462    5005.815
------------------------------------------------------------------------------

. do "C:\Users\u1972955\AppData\Local\Temp\STD4904_000000.tmp"

.   reg d_slpnap d_d81 d_totwrk d_educ d_gdhlth d_marr d_yngkid
note: d_d81 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       239
-------------+----------------------------------   F(5, 233)       =      8.19
       Model |  14674698.2         5  2934939.64   Prob > F        =    0.0000
    Residual |  83482611.7       233  358294.471   R-squared       =    0.1495
-------------+----------------------------------   Adj R-squared   =    0.1313
       Total |  98157309.9       238  412425.672   Root MSE        =    598.58

------------------------------------------------------------------------------
    d_slpnap | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       d_d81 |          0  (omitted)
    d_totwrk |  -.2266694    .036054    -6.29   0.000    -.2977029   -.1556359
      d_educ |  -.0244717   48.75938    -0.00   1.000    -96.09008    96.04113
    d_gdhlth |   87.57785   76.59913     1.14   0.254    -63.33758    238.4933
      d_marr |   104.2139   92.85536     1.12   0.263    -78.72946    287.1574
    d_yngkid |    94.6654   87.65252     1.08   0.281    -78.02739    267.3582
       _cons |  -92.63404    45.8659    -2.02   0.045    -182.9989   -2.269152
------------------------------------------------------------------------------

. 
end of do-file

. su totwrk

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      totwrk |        478    2043.659    972.0307          0       4805

. di 4805/60
80.083333

. su slpnap

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      slpnap |        478    3343.337    524.4218       1240       6110

. do "C:\Users\u1972955\AppData\Local\Temp\STD4904_000000.tmp"

.   gen hrssleep = slpnap/60

.   gen hrswork = totwrk/60

. 
end of do-file

. su hrs*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    hrssleep |        478    55.72228    8.740364   20.66667   101.8333
     hrswork |        478    34.06098    16.20051          0   80.08334

. di 8*7
56

. do "C:\Users\u1972955\AppData\Local\Temp\STD4904_000000.tmp"

.   cd "$dropbox/TA/EC203/Term 2/class16"
C:\Users\u1972955\Dropbox\TA\EC203\Term 2\class16

. 
.   use "sleep", clear

.   
. pause on

.   
.   cap log using class16, replace text

.   
.   gen hrssleep = hrssleep/60
hrssleep not found
r(111);

end of do-file

r(111);

. do "C:\Users\u1972955\AppData\Local\Temp\STD4904_000000.tmp"

.   cd "$dropbox/TA/EC203/Term 2/class16"
C:\Users\u1972955\Dropbox\TA\EC203\Term 2\class16

. 
.   use "sleep", clear

.   
. pause on

.   
.   cap log using class16, replace text

.   
.   gen hrssleep = slpnap/60

.   gen hrswork = totwrk/60

. 
.   reg hrssleep d81 hrswork educ gdhlth marr yngkid

      Source |       SS           df       MS      Number of obs   =       478
-------------+----------------------------------   F(6, 471)       =      8.50
       Model |  3559.10361         6  593.183935   Prob > F        =    0.0000
    Residual |  32880.8176       471   69.810653   R-squared       =    0.0977
-------------+----------------------------------   Adj R-squared   =    0.0862
       Total |  36439.9212       477  76.3939647   Root MSE        =    8.3553

------------------------------------------------------------------------------
    hrssleep | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         d81 |  -1.283828   .7994198    -1.61   0.109    -2.854699    .2870425
     hrswork |  -.1500954   .0244002    -6.15   0.000    -.1980421   -.1021487
        educ |  -.3376091   .1333363    -2.53   0.012    -.5996168   -.0756015
      gdhlth |   .4839554   .9929816     0.49   0.626    -1.467267    2.435177
        marr |  -.7032314   .8846449    -0.79   0.427     -2.44157    1.035108
      yngkid |   1.237632   1.288764     0.96   0.337    -1.294806     3.77007
       _cons |   65.97926   2.029439    32.51   0.000     61.99139    69.96714
------------------------------------------------------------------------------

. 
end of do-file

. di 0.22*60
13.2

. exit, clear
